{"inkVersion":20,"root":[["^System: Now that you're starting to get the hang of these activities, let's move on to a more precise one. The upgrade and replace activity is all about precision, you'll be the doctor of cybernetics!","\n",{"->":"StartChoices"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"StartChoices":[["ev","str","^Okay, so how do I play?","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":[{"->":"T1"},"\n",{"#f":5}]}],{"#f":1}],"T1":["^System: Good question. You're given two tools. Your goal is to remove the screws you see on that 3D cybernetic's hatch, move the hatch and then replace the component inside with the one you see in your toolbar. After that it's just replacing everything.","\n",{"->":"T1C"},{"#f":1}],"T1C":[["ev","str","^Okay. I'm good to start then","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":[{"->":"T2"},"\n",{"#f":5}]}],{"#f":1}],"T2":["^System: Good, let's start by left clicking the red screwdriver. Once you've done that you can use the tool on one of the screws by left clicking on that screw. Once you've completed that you should be able to right click in the toolbar to place the screw down.","\n",{"->":"T2C"},{"#f":1}],"T2C":[["ev","str","^Cool. I've just finished doing that","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":[{"->":"T3"},"\n",{"#f":5}]}],{"#f":1}],"T3":["^System: While holding the tools you can click on the dialogue choices, so don't worry about having to drop the tool in order to continue the dialogue. Oh right, to drop the tool you can right click, it cannot be holding a screw, if it is you'll drop the screw first.","\n",{"->":"T3C"},{"#f":1}],"T3C":[["ev","str","^I got it, let's continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":[{"->":"T41"},"\n",{"#f":5}]}],{"#f":1}],"T41":["^System: Click on an area next to a screw while holding the screwdriver, or anywhere on the cybernetic. Notice that the green bar; the patient's cybernetic stability, drops. Be careful as when you make a mistake with any tool it can drop.","\n",{"->":"T41C"},{"#f":1}],"T41C":[["ev","str","^I better be careful then.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Sounds like fun.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":[{"->":"T4"},"\n",{"#f":5}],"c-1":[{"->":"T4"},"\n",{"#f":5}]}],{"#f":1}],"T4":["^System: Anyways, you can now do the same with the rest of the screws. Once you're done, place the screwdriver down and left click the hatch they were on. You can now drag the hatch over to the side and reveal the broken component on the inside.","\n",{"->":"T4C"},{"#f":1}],"T4C":[["ev","str","^Oh yea, I see it. It looks pretty broken","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Looks normal to me, yep, totally fine.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":[{"->":"T5"},"\n",{"#f":5}],"c-1":[{"->":"T51"},"\n",{"#f":5}]}],{"#f":1}],"T5":["^System: The poor patient has been dealing with this for a while. Let's help them. The forceps work exactly the same as the screwdriver. Carefully grab the old component from inside of the cybernetic and place it into the toolbar.","\n",{"->":"T5C"},{"#f":1}],"T51":["^System: ...Right... Anyways the customers trust your judgement, but you also kinda need to do this, so follow my instructions anyways.","\n",{"->":"T512"},{"#f":1}],"T512":[{"#":"delay"},"^System: The forceps work exactly the same as the screwdriver. Carefully grab the old component from inside of the cybernetic and place it into the toolbar.","\n",{"->":"T5C"},{"#f":1}],"T5C":[["ev","str","^The old component has been succesfully removed!","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I removed the old component, but did some damage...","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":[{"->":"T6"},"\n",{"#f":5}],"c-1":[{"->":"T61"},"\n",{"#f":5}]}],{"#f":1}],"T6":["^System: Nice, now just grab the new one using the forceps, place it where the old one was and drop the forceps into the toolbar. After that all you need to do is replace the cover and drop the screws back into it in any order. I'll be back when you're done.","\n",{"->":"T6C"},{"#f":1}],"T61":["^System: Hey, that's okay. We're here to learn, no one's perfect. Now just grab the new component using the forceps, place it where the old one was and drop the forceps into the toolbar.","\n",{"->":"T62"},{"#f":1}],"T62":[["ev","str","^Mission Complete.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":[{"->":"T63"},"\n",{"#f":5}]}],{"#f":1}],"T63":["^System: Cool, after that all you need to do is replace the cover and drop the screws back into it in any order. I'll come back to you once you're done.","\n",{"->":"T6C"},{"#f":1}],"T6C":[[{"#":"wait"},{"#":"diverts"},"ev","str","^Okay.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":[{"->":"Repair_Success"},"\n",{"#f":5}]}],{"#f":1}],"Repair_Success":["^System: Congrats, you successfully saved your patient from further issues with the cybernetic. Feel proud, not many can do what you've done!","\n",{"->":"Final"},{"#f":1}],"MessUpRepair":["^System: You've made it here. How'd you get here you ask? Well the patient's cybernetic stability either hit 0 or it was between 20-40%. Be careful next time.","\n",{"->":"Final"},{"#f":1}],"Final":[{"#":"delay"},{"#":"last"},"^System: That's it for this activity, let's move on to the next one, I think you'll enjoy it!","\n","end",{"#f":1}],"global decl":["ev",0,{"VAR=":"RepairSuccess"},0,{"VAR=":"RepairFail"},"/ev","end",null],"#f":1}],"listDefs":{}}