{"inkVersion":20,"root":[["^System: This Activity will be a little different. You're given a monitor of the patient's vitals and you must press the serum buttons to increase the relevant vitals (shown next to the buttons in order of vitals).","\n",{"->":"T1"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"T1":[{"#":"delay"},"^System: This will be a time attack, so I cannot help you fully through once it starts. If a vital drops below 60 it will turn blue and the the System Shutdown timer will start. This will be the same if the vitals rise over 90, so be careful.","\n",{"->":"T1C"},{"#f":1}],"T1C":[[{"#":"next"},"ev","str","^Alright, I'm ready, let's start","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":[{"->":"T2"},"\n",{"#f":5}]}],{"#f":1}],"T2":["^System: If you've clicked the start button you should see the vitals moving. For now the Stabilizing rate timer should be decreasing, once that hits 0 you've succeeded. There's a winning strategy here, so go ahead and look for it. keep those vitals stable!","\n",{"->":"T2C"},{"#f":1}],"T2C":[[{"#":"wait"},{"#":"diverts"},"ev","str","^Let's do this!","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":[{"->":"Repair_Success"},"\n",{"#f":5}]}],{"#f":1}],"Repair_Success":["^System: Congratulations, you saved the patient from shock. Each iteration of this activity will be a tad harder than the last, keep that in mind. If you have a good strategy, make sure to use it!","\n",{"->":"Final"},{"#f":1}],"MessUpRepair":["^System: Dang, you shocked the patient. In normal circumstances the day would either restart or the patient would be lost forever. but since we're in a tutorial we'll still be moving forwards and our \"patient\" is still alive.","\n",{"->":"Final"},{"#f":1}],"Final":[{"#":"delay"},{"#":"last"},"^System: This is the last type of activity you'll have to deal with. After this just follow the instructions on screen and move on to the real thing. You've passed the exam, congratulations, you are now a certified Cybernetic Mechanic!","\n","end",{"#f":1}],"global decl":["ev",0,{"VAR=":"RepairSuccess"},0,{"VAR=":"RepairFail"},"/ev","end",null],"#f":1}],"listDefs":{}}