{"inkVersion":20,"root":[[{"->":"FalseHope"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"FalseHope":[[{"#":"Go"},"ev","str","^Start Repairs","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"Why"},"\n",{"#f":5}]}],{"#f":1}],"Why":["^How?","\n","end",{"#f":1}],"StillHere":["^Camilla: For now, but think of all those we've lost. All the freaks and beauties lost, bleeding on the edge. The scene has shrunk to half the size it was a year and a half ago.","\n",{"->":"StillHere2"},{"#f":1}],"StillHere2":[{"#":"delay"},"^Camilla: People die, or they uninstall. I went to the MEDicil clinic, and they recommended I go for uninstallation. I can't imagine it, but what choice do I have?","\n",{"->":"StillDidChoices"},{"#f":1}],"DidNotKnow":["^Camilla: But I knew who was getting it. It wasn't just anybody, it was us. The dancers, singers, artists, freaks and beauties on the edge.","\n",{"->":"DidNotKnow2"},{"#f":1}],"DidNotKnow2":[{"#":"delay"},"^Camilla: I went to the MEDicil clinic, and they were talking about uninstallation. I can't imagine it, but what choice do I have?","\n",{"->":"StillDidChoices"},{"#f":1}],"GladHelp":["^Camilla: You're still one of the only mechanics who'll see us. I know Joselito is going to the clinic at MEDicil, but they don't really treat him. Just do tests on him. I only went once, they kept talking about uninstallation.","\n",{"->":"StillDidChoices"},{"#f":1}],"Relief":["^Camilla: Maybe for a day or two, used to be a week or so, but I guess we can only fight so long. I tried the clinic at MEDicil, they didn't help.","\n",{"->":"Relief2"},{"#f":1}],"Relief2":[{"#":"delay"},"^Camilla: I only went once, but they kept talking about uninstallation. At the very least you get that that's not an option.","\n",{"->":"StillDidChoices"},{"#f":1}],"StillDidChoices":[[{"#":"wait"},"ev","str","^You wouldn't be yourself without your tail!","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I think you have to consider every possibility.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"WithoutTail"},"\n",{"#f":5}],"c-1":[{"->":"EveryPossibility"},"\n",{"#f":5}]}],{"#f":1}],"WithoutTail":[{"#":"last"},"^Camilla: Yeah.. My old life only comes back to me in fits and starts, but when I move my tail? It does feel like home. It's hard to accept your only option is to fight, especially after fighting so so long. I'll probably be seeing you soon.","\n","end",{"#f":1}],"EveryPossibility":[{"#":"last"},"^Camilla: I guess I do. Can't imagine it. God, maybe I do.","\n","end",{"#f":1}],"global decl":["ev",0,{"VAR=":"Mood"},0,{"VAR=":"NextMood"},"/ev","end",null],"#f":1}],"listDefs":{}}