{"inkVersion":20,"root":[["^Tusk: Camila's in a bad spot, I'm worried about her. Something is causing her raison d'etre, her most important cybernetic to malfunction.","\n",{"->":"MyChoices"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"MyChoices":[["ev","str","^Heard of her act, never gotten around to seeing it.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Is it that serious? Doctors can't help?","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Do you think it's her prosthesis?","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ",{"->":"Act"},"\n",{"#f":5}],"c-1":["^ ",{"->":"Doctor"},"\n",{"#f":5}],"c-2":["^ ",{"->":"Prosthesis"},"\n",{"#f":5}]}],{"#f":1}],"Act":["^Tusk: She's a jewel of a lady. She really mesmerizes the customers. Her service helps her family and my bar, I gotta say, that kid is something. Definitely more at home in the water than on land. So I was wondering if you could help her out just this once.","\n",{"->":"TuskHelp"},{"#f":1}],"Doctor":["^Tusk: No, they refuse to. With the advent of these differing prosthesis, people have found new ways to treat otherts disrespectfully. The doctors are all bigots. What with her being an aquatic worker, they don't treat her much more than the fishes. Do you think you could help her out?","\n",{"->":"TuskHelp"},{"#f":1}],"Prosthesis":["^Tusk: It's possible, but it's not normal Rejection Sickness. It is something much more aggressive. I was wondering if you would be able to help a kind soul like her out, just this once.","\n",{"->":"TuskHelp"},{"#f":1}],"TuskHelp":[["ev","str","^I don't know what I could do..","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^I'm no doc, but I can certainly try.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Of course, anything for y'all.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ",{"->":"notSure"},"\n",{"#f":5}],"c-1":[{"->":"willTry"},"\n",{"#f":5}],"c-2":[{"->":"allIn"},"\n",{"#f":5}]}],{"#f":1}],"notSure":["^Tusk: It's all right bud, I know you've also got a lot on your plate here in this district, just...listen closely...something ain't right in the neighborhood lately, so I'm trying my best to look out for the young'uns. Her family has been really pushing her to get it checked out lately, so I won't pester you anymore about this.","\n","done",{"#f":1}],"willTry":["^Tusk: No pressure on that, her family's already pushing her to get it looked at, but hey, thanks. I know there's a lot going on lately and something ain't right, meaning you've got a lot more on your plate, so that means all the more to her.","\n","done",{"#f":1}],"allIn":["^Tusk: I..well I didn't think you'd be so accepting of a new client, what with what's been happening lately. Are you sure you can accept a request from a client. Either way thanks a ton. I hope you can get to the bottom of this where the doctors failed to.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}